In [1]:
import pandas as pd

In [2]:
web={'Day' : [1, 2, 3, 4, 5, 6], 'Visitors': [1200, 700, 5500, 540, 400, 340], 'BounceRate' : [20, 30, 22, 15, 10, 35]}

In [3]:
df=pd.DataFrame(web)

In [4]:
df

   Day  Visitors  BounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10
5    6       340          35

In [5]:
print(df)

   Day  Visitors  BounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10
5    6       340          35

In [6]:
df.head()

   Day  Visitors  BounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10

In [7]:
df.head(3)

   Day  Visitors  BounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22

In [8]:
df.tail(2)

   Day  Visitors  BounceRate
4    5       400          10
5    6       340          35

In [9]:
df.tail()

   Day  Visitors  BounceRate
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10
5    6       340          35

In [10]:
df1=pd.DataFrame({'HPI':[90, 70, 60, 80], 'Rate': [2, 3, 1, 2], 'GDP':[50, 35, 40, 45], 'Year': [2015, 2016, 2017, 2018]})

In [11]:
df1

   HPI  Rate  GDP  Year
0   90     2   50  2015
1   70     3   35  2016
2   60     1   40  2017
3   80     2   45  2018

In [12]:
df2=pd.DataFrame({'HPI':[90, 70, 60, 80], 'Rate': [2, 3, 1, 2], 'GDP':[50, 35, 40, 45], 'Year': [2005, 2006, 2007, 2008]})

In [13]:
df2

   HPI  Rate  GDP  Year
0   90     2   50  2005
1   70     3   35  2006
2   60     1   40  2007
3   80     2   45  2008

In [14]:
mer=pd.merge(df1,df2)

In [15]:
mer

Empty DataFrame
Columns: [HPI, Rate, GDP, Year]
Index: []

In [16]:
mer=pd.merge(df1,df2, on='HPI')

In [17]:
mer

   HPI  Rate_x  GDP_x  Year_x  Rate_y  GDP_y  Year_y
0   90       2     50    2015       2     50    2005
1   70       3     35    2016       3     35    2006
2   60       1     40    2017       1     40    2007
3   80       2     45    2018       2     45    2008

In [22]:
df3=pd.DataFrame({'Name' : ['Sonali', 'Riya', 'Riddhi', 'Sona', 'Shakti'], 'Age': [20,19,19,20,20], 'Marks': [100, 95, 90, 85, 80]})

In [23]:
df3

     Name  Age  Marks
0  Sonali   20    100
1    Riya   19     95
2  Riddhi   19     90
3    Sona   20     85
4  Shakti   20     80

In [27]:
df4=pd.DataFrame({'RollNo' : [114, 115, 116, 117, 118], 'Course': ['DS','CSE', 'CSE', 'CSE','DS']})

In [28]:
df4

   RollNo Course
0     114     DS
1     115    CSE
2     116    CSE
3     117    CSE
4     118     DS

In [29]:
jn=df3.join(df4)

In [30]:
jn

     Name  Age  Marks  RollNo Course
0  Sonali   20    100     114     DS
1    Riya   19     95     115    CSE
2  Riddhi   19     90     116    CSE
3    Sona   20     85     117    CSE
4  Shakti   20     80     118     DS

In [31]:
jn=df4.join(df3)

In [32]:
jn

   RollNo Course    Name  Age  Marks
0     114     DS  Sonali   20    100
1     115    CSE    Riya   19     95
2     116    CSE  Riddhi   19     90
3     117    CSE    Sona   20     85
4     118     DS  Shakti   20     80

In [33]:
cat=pd.concat([df1,df2])

In [34]:
cat

   HPI  Rate  GDP  Year
0   90     2   50  2015
1   70     3   35  2016
2   60     1   40  2017
3   80     2   45  2018
0   90     2   50  2005
1   70     3   35  2006
2   60     1   40  2007
3   80     2   45  2008

In [35]:
cat=pd.concat([df1,df2],axis=1)

In [36]:
cat

   HPI  Rate  GDP  Year  HPI  Rate  GDP  Year
0   90     2   50  2015   90     2   50  2005
1   70     3   35  2016   70     3   35  2006
2   60     1   40  2017   60     1   40  2007
3   80     2   45  2018   80     2   45  2008

In [37]:
df1=pd.DataFrame({'Day':[1,2,3,4], 'Visitors': [100,150,200,250], 'BounceRate':[20,30,35,40]})

In [38]:
df1

   Day  Visitors  BounceRate
0    1       100          20
1    2       150          30
2    3       200          35
3    4       250          40

In [39]:
df1.set_index('Day', inplace=True)

In [40]:
df1

     Visitors  BounceRate
Day
1         100          20
2         150          30
3         200          35
4         250          40

In [41]:
df1=df1.rename(columns={'Visitors':'Users'})

In [42]:
df1

     Users  BounceRate
Day
1      100          20
2      150          30
3      200          35
4      250          40

In [43]:
s=pd.Series() #empty series 
print(s)

Series([], dtype: float64)

In [44]:
import numpy as np
data=np.array(['a','b','c','d'])

In [45]:
x=pd.Series(data)
print(x)

0    a
1    b
2    c
3    d
dtype: object

In [46]:
data={'a':10,'b':12,'c':14,'d':16}
x=pd.Series(data)
print(x)

a    10
b    12
c    14
d    16
dtype: int64

In [48]:
exam_data={'Student':['Sonali','Sohan','Riya','Riddhi','Sona','Shakti'],
           'Rank':[1, 2, 3, 2, 3, 4],
           'Year':[2016, 2017, 2018, 2015, 2020, 2018],
           'Marks':[850, 940, 690, 900, 750, 875]
          }
df=pd.DataFrame(exam_data)
df

  Student  Rank  Year  Marks
0  Sonali     1  2016    850
1   Sohan     2  2017    940
2    Riya     3  2018    690
3  Riddhi     2  2015    900
4    Sona     3  2020    750
5  Shakti     4  2018    875

In [49]:
print(df.groupby('Student').groups)

{'Riddhi': Int64Index([3], dtype='int64'), 'Riya': Int64Index([2], dtype='int64'), 'Shakti': Int64Index([5], dtype='int64'), 'Sohan': Int64Index([1], dtype='int64'), 'Sona': Int64Index([4], dtype='int64'), 'Sonali': Int64Index([0], dtype='int64')}

In [50]:
print(df.groupby('Year').groups)

{2015: Int64Index([3], dtype='int64'), 2016: Int64Index([0], dtype='int64'), 2017: Int64Index([1], dtype='int64'), 2018: Int64Index([2, 5], dtype='int64'), 2020: Int64Index([4], dtype='int64')}

In [51]:
data=pd.read_csv('Data.csv')

In [52]:
print(data)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [53]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [54]:
data.shape

(10, 4)

In [55]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [57]:
data.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [58]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [60]:
data.isnull

<bound method DataFrame.isnull of    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes>

In [63]:
data.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [64]:
data.Age=data.Age.fillna(data.Age.median())
data['Salary']=data['Salary'].fillna(data['Salary'].mean())

In [65]:
data

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [67]:
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [68]:
data.loc[2:5]

   Country   Age        Salary Purchased
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes

In [69]:
data.loc[data.Age>45]

   Country   Age   Salary Purchased
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No

In [70]:
data.iloc[7]

Country      France
Age              48
Salary        79000
Purchased       Yes
Name: 7, dtype: object

In [71]:
data.Country.value_counts()

France     4
Germany    3
Spain      3
Name: Country, dtype: int64

In [72]:
data.Purchased.unique()

array(['No', 'Yes'], dtype=object)

In [73]:
data.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)